{
  "database_id": 4,
  "database_name": "user_roles",
  "database_description": "База данных хранит информацию о ролях, которые пользователь исполняет в рамках различных каналов. Эти роли включают в себя ключевые ценности, методы, стили и продукты, которые пользователь продвигает в своих каналах.",
  "database_usage": "Эта база используется для того, чтобы определить и анализировать различные роли пользователя, на основе которых ИИ-ассистенты могут формировать персонализированные контент-стратегии и рекомендации для разных каналов.",
  "variables": [
    {
      "name": "role_id",
      "type": "int",
      "description": "Уникальный идентификатор роли, который связывает её с пользователем.",
      "example": "101",
      "constraints": "primary key"
    },
    {
      "name": "user_id",
      "type": "int",
      "description": "Идентификатор пользователя, которому принадлежит данная роль.",
      "example": "1001",
      "constraints": "foreign key, references users_akkaunts(user_id)"
    },
    {
      "name": "role_name",
      "type": "varchar",
      "description": "Название роли, которую пользователь выполняет в одном или нескольких каналах.",
      "example": "\"Трансформационный ментор\", \"Семейный психолог\", \"Цифровой маркетолог\""
    },
    {
      "name": "role_description",
      "type": "text",
      "description": "Краткое описание роли, в котором обобщаются ключевые функции и обязанности, связанные с этой ролью.",
      "example": "\"Трансформационный ментор, фокусирующийся на работе с личными трансформациями через метафизические практики.\""
    },
    {
      "name": "role_values",
      "type": "text",
      "description": "Основные ценности, которые ассоциируются с данной ролью, отражающие философию пользователя.",
      "example": "\"Осознанность, развитие, внутренний мир, личностный рост.\""
    },
    {
      "name": "role_expertise",
      "type": "text",
      "description": "Подробное описание навыков, знаний и опыта пользователя в рамках данной роли.",
      "example": "\"Эксперт с более чем 10-летним опытом работы в менторстве, с использованием методов трансерфинга и когнитивных практик.\""
    },
    {
      "name": "role_methods",
      "type": "text",
      "description": "Методики и подходы, которые пользователь применяет в рамках этой роли.",
      "example": "\"Методы трансерфинга, когнитивно-поведенческая терапия, работа с метафорами.\""
    },
    {
      "name": "role_style",
      "type": "text",
      "description": "Стиль подачи информации и взаимодействия с аудиторией, подходящий для данной роли.",
      "example": "\"Легкий и метафорический стиль, использование историй для объяснения сложных концепций.\""
    },
    {
      "name": "related_content",
      "type": "json",
      "description": "Ссылки на существующие статьи, видео, курсы и другие материалы, которые отражают подход пользователя в этой роли.",
      "example": "\"Ссылки на статьи в блоге о трансерфинге, видео с объяснением техник трансформации.\""
    },
    {
      "name": "user_product",
      "type": "json",
      "description": "Описание продуктов или услуг, которые пользователь предлагает в рамках данной роли.",
      "example": "\"Авторский курс 'Трансерфинг реальности', менторские консультации.\""
    },
    {
      "name": "user_audience",
      "type": "json",
      "description": "Описание целевой аудитории, включая возраст, интересы, запросы, для которой предназначен контент и услуги данной роли.",
      "example": "\"Молодые специалисты 25-40 лет, интересующиеся метафизикой и личностным ростом.\""
    },
    {
      "name": "role_teachers",
      "type": "json",
      "description": "Список учителей, курсов и учебных заведений, которые повлияли на формирование данной роли.",
      "example": "\"Курсы Вадима Зеланда, мастер-классы по когнитивно-поведенческой терапии.\""
    },
    {
      "name": "user_role_vectors",
      "type": "json",
      "description": "Векторное представление всех переменных, связанных с данной ролью. Включает описание взаимосвязей между аспектами роли.",
      "example": "\"JSON-структура, описывающая взаимосвязь ценностей, методов и стиля данной роли.\""
    }
  ]
}
